solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;
    uint32_t retry               = SD_CMD13_RETRY_TIMES;

    command.index        = (uint32_t)kSDMMC_SendStatus;
    command.argument     = card->relativeAddress << 16U;
    command.responseType = kCARD_ResponseTypeR1;

    content.command = &command;
    content.data    = NULL;
    while (retry != 0U)
    {
        error = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success != error)
        {
            SDMMC_LOG("\r\nError: send CMD13 failed with host error %d, response %x\r\n", error, command.response[0U]);
            retry--;
            continue;
        }
        else
        {
            if (((command.response[0U] & SDMMC_MASK(kSDMMC_R1ReadyForDataFlag)) != 0U) &&
                (SDMMC_R1_CURRENT_STATE(command.response[0U]) != (uint32_t)kSDMMC_R1StateProgram))
            {
                error = kStatus_SDMMC_CardStatusIdle;
            }
            else
            {
                error = kStatus_SDMMC_CardStatusBusy;
            }
            break;
        }
    }

    return error;
}

status_t SD_PollingCardStatusBusy(sd_card_t *card, uint32_t timeoutMs)
{
    assert(card != NULL);

    uint32_t statusTimeoutUs = timeoutMs * 1000U;
    bool cardBusy            = false;
    status_t error           = kStatus_SDMMC_CardStatusBusy;

    do
    {
        cardBusy = SDMMCHOST_IsCardBusy(card->host);

        if (cardBusy == false)
        {
            error = SD_SendCardStatus(card);
            if (error == kStatus_SDMMC_CardStatusIdle)
            {
                break;
            }
        }
        else
        {
            /* Delay 125us to throttle the polling rate */
            statusTimeoutUs -= SDMMC_OSADelayUs(125U);
        }

    } while (statusTimeoutUs != 0U);

    return error;
}

static status_t SD_SendWriteSuccessBlocks(sd_card_t *card, uint32_t *blocks)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    status_t error               = kStatus_Success;
    uint32_t *rawBuffer          = (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);

    (void)memset(rawBuffer, 0, 4U);

    /* Wait for the card write process complete because of that card read process and write process use one buffer. */
    error = SD_PollingCardStatusBusy(card, SD_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_WaitWriteCompleteFailed;
    }

    if (kStatus_Success != SD_SendApplicationCmd(card, card->relativeAddress))
    {
        return kStatus_SDMMC_SendApplicationCommandFailed;
    }

    command.index        = (uint32_t)kSD_ApplicationSendNumberWriteBlocks;
    command.responseType = kCARD_ResponseTypeR1;

    data.blockSize  = 4U;
    data.blockCount = 1U;
    data.rxData     = rawBuffer;

    content.command = &command;
    content.data    = &data;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success != error) || (((command.response[0U]) & SDMMC_R1_ALL_ERROR_FLAG) != 0U))
    {
        SDMMC_LOG("\r\nError: send ACMD22 failed with host error %d, response %x\r\n", error, command.response[0U]);
    }
    else
    {
        *blocks = SWAP_WORD_BYTE_SEQUENCE(*rawBuffer);
    }

    return error;
}

static status_t SD_SendRca(sd_card_t *card)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSD_SendRelativeAddress;
    command.argument     = 0U;
    command.responseType = kCARD_ResponseTypeR6;

    content.command = &command;
    content.data    = NULL;

    error = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success == error)
    {
        card->relativeAddress = (command.response[0U] >> 16U);
    }
    else
    {
        SDMMC_LOG("\r\nError: send CMD3 failed with host error %d, response %x\r\n", error, command.response[0U]);
    }

    return error;
}

static status_t SD_SwitchFunction(sd_card_t *card, uint32_t mode, uint32_t group, uint32_t number, uint32_t *status)
{
    assert(card != NULL);
    assert(status != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    status_t error               = kStatus_Success;

    command.index    = (uint32_t)kSD_Switch;
    command.argument = (mode << 31U | 0x00FFFFFFU);
    command.argument &= ~((uint32_t)(0xFU) << (group * 4U));
    command.argument |= (number << (group * 4U));
    command.responseType = kCARD_ResponseTypeR1;

    data.blockSize  = 64U;
    data.blockCount = 1U;
    data.rxData     = status;

    content.command = &command;
    content.data    = &data;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success != error) || (((command.response[0U]) & SDMMC_R1_ALL_ERROR_FLAG) != 0U))
    {
        SDMMC_LOG("\r\n\r\nError: send CMD6 failed with host error %d, response %x\r\n", error, command.response[0U]);
    }

    return error;
}

static void SD_DecodeScr(sd_card_t *card, uint32_t *rawScr)
{
    assert(card != NULL);
    assert(rawScr != NULL);

    sd_scr_t *scr;

    scr                  = &(card->scr);
    scr->scrStructure    = (uint8_t)((rawScr[0U] & 0xF0000000U) >> 28U);
    scr->sdSpecification = (uint8_t)((rawScr[0U] & 0xF000000U) >> 24U);
    if ((uint8_t)((rawScr[0U] & 0x800000U) >> 23U) != 0U)
    {
        scr->flags |= (uint16_t)kSD_ScrDataStatusAfterErase;
    }
    scr->sdSecurity  = (uint8_t)((rawScr[0U] & 0x700000U) >> 20U);
    scr->sdBusWidths = (uint8_t)((rawScr[0U] & 0xF0000U) >> 16U);
    if ((uint8_t)((rawScr[0U] & 0x8000U) >> 15U) != 0U)
    {
        scr->flags |= (uint16_t)kSD_ScrSdSpecification3;
    }
    scr->extendedSecurity        = (uint8_t)((rawScr[0U] & 0x7800U) >> 10U);
    scr->commandSupport          = (uint8_t)(rawScr[0U] & 0x3U);
    scr->reservedForManufacturer = rawScr[1U];
    /* Get specification version. */
    if (scr->sdSpecification == 0U)
    {
        card->version = kSD_SpecificationVersion1_0;
    }
    else if (scr->sdSpecification == 1U)
    {
        card->version = kSD_SpecificationVersion1_1;
    }
    else if (scr->sdSpecification == 2U)
    {
        card->version = kSD_SpecificationVersion2_0;
        if ((card->scr.flags & (uint32_t)kSD_ScrSdSpecification3) != 0U)
        {
            card->version = kSD_SpecificationVersion3_0;
        }
    }
    else
    {
        /* reserved */
    }

    if ((card->scr.sdBusWidths & 0x4U) != 0U)
    {
        card->flags |= (uint32_t)kSD_Support4BitWidthFlag;
    }
    /* speed class control cmd */
    if ((card->scr.commandSupport & 0x01U) != 0U)
    {
        card->flags |= (uint32_t)kSD_SupportSpeedClassControlCmd;
    }
    /* set block count cmd */
    if ((card->scr.commandSupport & 0x02U) != 0U)
    {
        card->flags |= (uint32_t)kSD_SupportSetBlockCountCmd;
    }
}

static status_t SD_SendScr(sd_card_t *card)
{
    assert(card != NULL);

