solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
    sd_csd_t *csd;

    csd                      = &(card->csd);
    csd->csdStructure        = (uint8_t)((rawCsd[3U] & 0xC0000000U) >> 30U);
    csd->dataReadAccessTime1 = (uint8_t)((rawCsd[3U] & 0xFF0000U) >> 16U);
    csd->dataReadAccessTime2 = (uint8_t)((rawCsd[3U] & 0xFF00U) >> 8U);
    csd->transferSpeed       = (uint8_t)(rawCsd[3U] & 0xFFU);
    csd->cardCommandClass    = (uint16_t)((rawCsd[2U] & 0xFFF00000U) >> 20U);
    csd->readBlockLength     = (uint8_t)((rawCsd[2U] & 0xF0000U) >> 16U);
    if ((rawCsd[2U] & 0x8000U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdReadBlockPartialFlag;
    }
    if ((rawCsd[2U] & 0x4000U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdReadBlockPartialFlag;
    }
    if ((rawCsd[2U] & 0x2000U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdReadBlockMisalignFlag;
    }
    if ((rawCsd[2U] & 0x1000U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdDsrImplementedFlag;
    }
    if (csd->csdStructure == 0U)
    {
        csd->deviceSize = (uint32_t)((rawCsd[2U] & 0x3FFU) << 2U);
        csd->deviceSize |= (uint32_t)((rawCsd[1U] & 0xC0000000U) >> 30U);
        csd->readCurrentVddMin    = (uint8_t)((rawCsd[1U] & 0x38000000U) >> 27U);
        csd->readCurrentVddMax    = (uint8_t)((rawCsd[1U] & 0x7000000U) >> 24U);
        csd->writeCurrentVddMin   = (uint8_t)((rawCsd[1U] & 0xE00000U) >> 20U);
        csd->writeCurrentVddMax   = (uint8_t)((rawCsd[1U] & 0x1C0000U) >> 18U);
        csd->deviceSizeMultiplier = (uint8_t)((rawCsd[1U] & 0x38000U) >> 15U);

        /* Get card total block count and block size. */
        card->blockCount = ((csd->deviceSize + 1U) << (csd->deviceSizeMultiplier + 2U));
        card->blockSize  = (1UL << (csd->readBlockLength));
        if (card->blockSize != FSL_SDMMC_DEFAULT_BLOCK_SIZE)
        {
            card->blockCount = (card->blockCount * card->blockSize);
            card->blockSize  = FSL_SDMMC_DEFAULT_BLOCK_SIZE;
            card->blockCount = (card->blockCount / card->blockSize);
        }
    }
    else if (csd->csdStructure == 1U)
    {
        card->blockSize = FSL_SDMMC_DEFAULT_BLOCK_SIZE;

        csd->deviceSize = (uint32_t)((rawCsd[2U] & 0x3FU) << 16U);
        csd->deviceSize |= (uint32_t)((rawCsd[1U] & 0xFFFF0000U) >> 16U);
        if (csd->deviceSize >= 0xFFFFU)
        {
            card->flags |= (uint32_t)kSD_SupportSdxcFlag;
        }

        card->blockCount = ((csd->deviceSize + 1U) * 1024U);
    }
    else
    {
        /* not support csd version */
    }

    if ((uint8_t)((rawCsd[1U] & 0x4000U) >> 14U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdEraseBlockEnabledFlag;
    }
    csd->eraseSectorSize       = (uint8_t)((rawCsd[1U] & 0x3F80U) >> 7U);
    csd->writeProtectGroupSize = (uint8_t)(rawCsd[1U] & 0x7FU);
    if ((uint8_t)(rawCsd[0U] & 0x80000000U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdWriteProtectGroupEnabledFlag;
    }
    csd->writeSpeedFactor = (uint8_t)((rawCsd[0U] & 0x1C000000U) >> 26U);
    csd->writeBlockLength = (uint8_t)((rawCsd[0U] & 0x3C00000U) >> 22U);
    if ((uint8_t)((rawCsd[0U] & 0x200000U) >> 21U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdWriteBlockPartialFlag;
    }
    if ((uint8_t)((rawCsd[0U] & 0x8000U) >> 15U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdFileFormatGroupFlag;
    }
    if ((uint8_t)((rawCsd[0U] & 0x4000U) >> 14U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdCopyFlag;
    }
    if ((uint8_t)((rawCsd[0U] & 0x2000U) >> 13U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdPermanentWriteProtectFlag;
    }
    if ((uint8_t)((rawCsd[0U] & 0x1000U) >> 12U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdTemporaryWriteProtectFlag;
    }
    csd->fileFormat = (uint8_t)((rawCsd[0U] & 0xC00U) >> 10U);
}

static status_t SD_SendCsd(sd_card_t *card)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSDMMC_SendCsd;
    command.argument     = (card->relativeAddress << 16U);
    command.responseType = kCARD_ResponseTypeR2;

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success == error)
    {
        (void)memcpy(card->internalBuffer, (uint8_t *)command.response, 16U);
        /* The response is from bit 127:8 in R2, corrisponding to command.response[3U]:command.response[0U][31U:8]. */
        SD_DecodeCsd(card, (uint32_t *)(uint32_t)card->internalBuffer);
    }
    else
    {
        error = kStatus_SDMMC_TransferFailed;
        SDMMC_LOG("\r\nError: send CMD9(get csd) failed with host error %d, response %x\r\n", error,
                  command.response[0U]);
    }

    return error;
}

static void SD_DecodeCid(sd_card_t *card, uint32_t *rawCid)
{
    assert(card != NULL);
    assert(rawCid != NULL);

    sd_cid_t *cid;

    cid                 = &(card->cid);
    cid->manufacturerID = (uint8_t)((rawCid[3U] & 0xFF000000U) >> 24U);
    cid->applicationID  = (uint16_t)((rawCid[3U] & 0xFFFF00U) >> 8U);

    cid->productName[0U] = (uint8_t)((rawCid[3U] & 0xFFU));
    cid->productName[1U] = (uint8_t)((rawCid[2U] & 0xFF000000U) >> 24U);
    cid->productName[2U] = (uint8_t)((rawCid[2U] & 0xFF0000U) >> 16U);
    cid->productName[3U] = (uint8_t)((rawCid[2U] & 0xFF00U) >> 8U);
    cid->productName[4U] = (uint8_t)((rawCid[2U] & 0xFFU));

    cid->productVersion = (uint8_t)((rawCid[1U] & 0xFF000000U) >> 24U);

    cid->productSerialNumber = (uint32_t)((rawCid[1U] & 0xFFFFFFU) << 8U);
    cid->productSerialNumber |= (uint32_t)((rawCid[0U] & 0xFF000000U) >> 24U);

    cid->manufacturerData = (uint16_t)((rawCid[0U] & 0xFFF00U) >> 8U);
}

static status_t SD_AllSendCid(sd_card_t *card)
{
    assert(card != NULL);

