solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_SDMMC_TransferFailed;

    command.index        = (uint32_t)kSDMMC_AllSendCid;
    command.argument     = 0U;
    command.responseType = kCARD_ResponseTypeR2;

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success == error)
    {
        (void)memcpy(card->internalBuffer, (uint8_t *)command.response, 16U);
        SD_DecodeCid(card, (uint32_t *)(uint32_t)card->internalBuffer);

        error = kStatus_Success;
    }

    return error;
}

static status_t SD_ApplicationSendOperationCondition(sd_card_t *card, uint32_t argument)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Fail;
    uint32_t i                   = FSL_SDMMC_MAX_VOLTAGE_RETRIES;

    command.index        = (uint32_t)kSD_ApplicationSendOperationCondition;
    command.argument     = argument;
    command.responseType = kCARD_ResponseTypeR3;

    while (0U != i--)
    {
        if (kStatus_Success != SD_SendApplicationCmd(card, 0U))
        {
            continue;
        }

        content.command = &command;
        content.data    = NULL;
        error           = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success != error)
        {
            SDMMC_LOG("\r\nError: send ACMD41 failed with host error %d, response %x\r\n", error, command.response[0U]);
            return kStatus_SDMMC_TransferFailed;
        }

        /* Wait until card exit busy state. */
        if ((command.response[0U] & SDMMC_MASK(kSD_OcrPowerUpBusyFlag)) != 0U)
        {
            /* high capacity check */
            if ((command.response[0U] & SDMMC_MASK(kSD_OcrCardCapacitySupportFlag)) != 0U)
            {
                card->flags |= (uint32_t)kSD_SupportHighCapacityFlag;
            }
            /* 1.8V support */
            if ((command.response[0U] & SDMMC_MASK(kSD_OcrSwitch18AcceptFlag)) != 0U)
            {
                card->flags |= (uint32_t)kSD_SupportVoltage180v;
            }
            card->ocr = command.response[0U];

            return kStatus_Success;
        }

        SDMMC_OSADelay(10U);
    }

    SDMMC_LOG("\r\nError: send ACMD41 timeout\r\n");

    return error;
}

static status_t SD_SendInterfaceCondition(sd_card_t *card)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    uint32_t i                   = FSL_SDMMC_MAX_CMD_RETRIES;
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSD_SendInterfaceCondition;
    command.argument     = 0x1AAU;
    command.responseType = kCARD_ResponseTypeR7;

    content.command = &command;
    content.data    = NULL;
    do
    {
        error = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success != error)
        {
            SDMMC_LOG("\r\nError: send CMD8 failed with host error %d, response %x\r\n", error, command.response[0U]);
        }
        else
        {
            if ((command.response[0U] & 0xFFU) != 0xAAU)
            {
                error = kStatus_SDMMC_CardNotSupport;
                SDMMC_LOG("\r\nError: card not support CMD8\r\n");
            }
            else
            {
                error = kStatus_Success;
            }
        }
    } while ((--i != 0U) && (error != kStatus_Success));

    return error;
}

static status_t SD_SelectBusTiming(sd_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_SDMMC_SwitchBusTimingFailed;

    if (card->operationVoltage != kSDMMC_OperationVoltage180V)
    {
        /* group 1, function 1 ->high speed mode*/
        error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR25HighSpeed);
        /* If the result isn't "switching to high speed mode(50MHZ) successfully or card doesn't support high speed
         * mode". Return failed status. */
        if (error == kStatus_Success)
        {
            card->currentTiming = kSD_TimingSDR25HighSpeedMode;
            card->busClock_Hz =
                SDMMCHOST_SetCardClock(card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
        }
        else
        {
            if (error == kStatus_SDMMC_NotSupportYet)
            {
                /* if not support high speed, keep the card work at default mode */
                SDMMC_LOG("\r\nNote: High speed mode is not supported by card\r\n");
                return kStatus_Success;
            }
        }
    }
    /* card is in UHS_I mode */
    else
    {
        do
        {
            if (card->currentTiming == kSD_TimingSDR12DefaultMode)
            {
                /* if timing not specified, probe card capability from SDR104 mode */
                card->currentTiming = kSD_TimingSDR104Mode;
            }

            if (card->currentTiming == kSD_TimingSDR104Mode)
            {
                if ((card->host->capability & (uint32_t)kSDMMCHOST_SupportSDR104) != 0U)
                {
                    error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR104);
                    if (error == kStatus_Success)
                    {
                        card->currentTiming = kSD_TimingSDR104Mode;
                        card->busClock_Hz   = SDMMCHOST_SetCardClock(
                            card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_208MHZ));
                        break;
                    }
                }
                SDMMC_LOG("\r\nNote: SDR104 mode is not supported\r\n");
                card->currentTiming = kSD_TimingDDR50Mode;
            }

            if (card->currentTiming == kSD_TimingDDR50Mode)
            {
                error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionDDR50);
                if (error == kStatus_Success)
                {
                    card->currentTiming = kSD_TimingDDR50Mode;
                    card->busClock_Hz   = SDMMCHOST_SetCardClock(
                        card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
                    SDMMCHOST_EnableDDRMode(card->host, true, 0U);
                    break;
                }
                SDMMC_LOG("\r\nNote: DDR50 mode is not supported\r\n");
                card->currentTiming = kSD_TimingSDR50Mode;
            }

