solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
            if (card->currentTiming == kSD_TimingSDR50Mode)
            {
                if ((card->host->capability & (uint32_t)kSDMMCHOST_SupportSDR50) != 0U)
                {
                    error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR50);
                    if (error == kStatus_Success)
                    {
                        card->currentTiming = kSD_TimingSDR50Mode;
                        card->busClock_Hz   = SDMMCHOST_SetCardClock(
                            card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_100MHZ));
                        break;
                    }
                }
                SDMMC_LOG("\r\nNote: SDR50 mode is not supported\r\n");
                card->currentTiming = kSD_TimingSDR25HighSpeedMode;
            }

            if (card->currentTiming == kSD_TimingSDR25HighSpeedMode)
            {
                error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR25HighSpeed);
                if (error == kStatus_Success)
                {
                    card->currentTiming = kSD_TimingSDR25HighSpeedMode;
                    card->busClock_Hz   = SDMMCHOST_SetCardClock(
                        card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
                    break;
                }
            }

            SDMMC_LOG("\r\nWarning: unknown timing mode\r\n");
        } while (false);
    }

    if (error == kStatus_Success)
    {
        /* Update io strength according to different bus frequency */
        if (card->usrParam.ioStrength != NULL)
        {
            card->usrParam.ioStrength(card->busClock_Hz);
        }

        /* SDR50 and SDR104 mode need tuning */
        if ((card->currentTiming == kSD_TimingSDR50Mode) || (card->currentTiming == kSD_TimingSDR104Mode))
        {
            /* execute tuning */
            if (SD_ExecuteTuning(card) != kStatus_Success)
            {
                SDMMC_LOG("\r\nError: tuning failed for mode %d\r\n", card->currentTiming);
                return kStatus_SDMMC_TuningFail;
            }
        }
    }

    return error;
}

static void SD_DecodeStatus(sd_card_t *card, uint32_t *src)
{
    assert(card != NULL);
    assert(src != NULL);

    card->stat.busWidth        = (uint8_t)((src[0U] & 0xC0000000U) >> 30U);                                /* 511-510 */
    card->stat.secureMode      = (uint8_t)((src[0U] & 0x20000000U) >> 29U);                                /* 509 */
    card->stat.cardType        = (uint16_t)((src[0U] & 0x0000FFFFU));                                      /* 495-480 */
    card->stat.protectedSize   = src[1U];                                                                  /* 479-448 */
    card->stat.speedClass      = (uint8_t)((src[2U] & 0xFF000000U) >> 24U);                                /* 447-440 */
    card->stat.performanceMove = (uint8_t)((src[2U] & 0x00FF0000U) >> 16U);                                /* 439-432 */
    card->stat.auSize          = (uint8_t)((src[2U] & 0x0000F000U) >> 12U);                                /* 431-428 */
    card->stat.eraseSize = (uint16_t)(((src[2U] & 0x000000FFU) << 8U) | ((src[3U] & 0xFF000000U) >> 24U)); /* 423-408 */
    card->stat.eraseTimeout  = (((uint8_t)((src[3U] & 0x00FF0000U) >> 16U)) & 0xFCU) >> 2U;                /* 407-402 */
    card->stat.eraseOffset   = ((uint8_t)((src[3U] & 0x00FF0000U) >> 16U)) & 0x3U;                         /* 401-400 */
    card->stat.uhsSpeedGrade = (((uint8_t)((src[3U] & 0x0000FF00U) >> 8U)) & 0xF0U) >> 4U;                 /* 399-396 */
    card->stat.uhsAuSize     = ((uint8_t)((src[3U] & 0x0000FF00U) >> 8U)) & 0xFU;                          /* 395-392 */
}

status_t SD_ReadStatus(sd_card_t *card)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    status_t error               = kStatus_Success;
    uint32_t *rawPointer         = (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);

    (void)memset(rawPointer, 0, 64U);

    /* wait card status ready. */
    error = SD_PollingCardStatusBusy(card, SD_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_WaitWriteCompleteFailed;
    }

    if (kStatus_Success != SD_SendApplicationCmd(card, card->relativeAddress))
    {
        return kStatus_SDMMC_SendApplicationCommandFailed;
    }

    command.index        = (uint32_t)kSDMMC_SendStatus;
    command.responseType = kCARD_ResponseTypeR1;

    data.blockSize  = 64U;
    data.blockCount = 1U;
    data.rxData     = rawPointer;

    content.command = &command;
    content.data    = &data;
    error           = SD_Transfer(card, &content, 3U);
    if ((kStatus_Success != error) || (((command.response[0U]) & SDMMC_R1_ALL_ERROR_FLAG) != 0U))
    {
        SDMMC_LOG("\r\nError: send ACMD13 failed with host error %d, response %x\r\n", error, command.response[0U]);

        return kStatus_SDMMC_TransferFailed;
    }
    /* switch to little endian sequence */
    SDMMCHOST_ConvertDataToLittleEndian(card->host, rawPointer, 16U, kSDMMC_DataPacketFormatMSBFirst);
    SD_DecodeStatus(card, rawPointer);

    return kStatus_Success;
}

status_t SD_SelectCard(sd_card_t *card, bool isSelected)
{
    assert(card != NULL);

    return SDMMC_SelectCard(card->host, card->relativeAddress, isSelected);
}

status_t SD_SetDriverStrength(sd_card_t *card, sd_driver_strength_t driverStrength)
{
    assert(card != NULL);

    status_t error;
    uint32_t strength = (uint32_t)driverStrength;

    error = SD_SelectFunction(card, kSD_GroupDriverStrength, strength);

    return error;
}

status_t SD_SetMaxCurrent(sd_card_t *card, sd_max_current_t maxCurrent)
{
    assert(card != NULL);

    status_t error;
    uint32_t current = (uint32_t)maxCurrent;

