solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
    error = SD_SelectFunction(card, kSD_GroupCurrentLimit, current);

    return error;
}

static status_t SD_Read(sd_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockSize, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);
    assert(blockSize == FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    status_t error               = kStatus_Success;
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};

    if ((((card->flags & (uint32_t)kSD_SupportHighCapacityFlag) != 0U) && (blockSize != 512U)) ||
        (blockSize > card->blockSize) || (blockSize > card->host->maxBlockSize) || ((blockSize % 4U) != 0U))
    {
        SDMMC_LOG("\r\nError: read with parameter, block size %d is not support\r\n", blockSize);
        return kStatus_SDMMC_CardNotSupport;
    }

    /* read command are not allowed while card is programming */
    error = SD_PollingCardStatusBusy(card, SD_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        SDMMC_LOG("Error : read failed with wrong card busy\r\n");
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    data.blockSize           = blockSize;
    data.blockCount          = blockCount;
    data.rxData              = (uint32_t *)(uint32_t)buffer;
    data.enableAutoCommand12 = true;

    command.index    = (blockCount == 1U) ? (uint32_t)kSDMMC_ReadSingleBlock : (uint32_t)kSDMMC_ReadMultipleBlock;
    command.argument = startBlock;
    if (0U == (card->flags & (uint32_t)kSD_SupportHighCapacityFlag))
    {
        command.argument *= data.blockSize;
    }
    command.responseType       = kCARD_ResponseTypeR1;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = &data;

    error = SD_Transfer(card, &content, 3U);
    if (error != kStatus_Success)
    {
        return error;
    }

    return kStatus_Success;
}

static status_t SD_Write(sd_card_t *card,
                         const uint8_t *buffer,
                         uint32_t startBlock,
                         uint32_t blockSize,
                         uint32_t blockCount,
                         uint32_t *writtenBlocks)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);
    assert(blockSize == FSL_SDMMC_DEFAULT_BLOCK_SIZE);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    status_t error;

    if ((((card->flags & (uint32_t)kSD_SupportHighCapacityFlag) != 0U) && (blockSize != 512U)) ||
        (blockSize > card->blockSize) || (blockSize > card->host->maxBlockSize) || ((blockSize % 4U) != 0U))
    {
        SDMMC_LOG("\r\nError: write with parameter, block size %d is not support\r\n", blockSize);
        return kStatus_SDMMC_CardNotSupport;
    }

    /* polling card status idle */
    error = SD_PollingCardStatusBusy(card, SD_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        SDMMC_LOG("Error : write failed, card status busy\r\n");
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    data.enableAutoCommand12   = true;
    data.blockSize             = blockSize;
    command.responseType       = kCARD_ResponseTypeR1;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    command.index    = (blockCount == 1U) ? (uint32_t)kSDMMC_WriteSingleBlock : (uint32_t)kSDMMC_WriteMultipleBlock;
    command.argument = startBlock;
    if (0U == (card->flags & (uint32_t)kSD_SupportHighCapacityFlag))
    {
        command.argument *= data.blockSize;
    }

    *writtenBlocks  = blockCount;
    data.blockCount = blockCount;
    data.txData     = (const uint32_t *)(uint32_t)buffer;

    content.command = &command;
    content.data    = &data;

    error = SD_Transfer(card, &content, 3U);
    if (error != kStatus_Success)
    {
        error = SD_SendWriteSuccessBlocks(card, writtenBlocks);
        /* check the successfully written block */
        if (error == kStatus_Success)
        {
            if (*writtenBlocks != 0U)
            {
                /* written success, but not all the blocks are written */
                error = kStatus_Success;
            }
        }
        SDMMC_LOG("\r\nWarning: write failed with block count %d, successed %d\r\n", blockCount, *writtenBlocks);
    }

    return error;
}

static status_t SD_Erase(sd_card_t *card, uint32_t startBlock, uint32_t blockCount, uint32_t timeout)
{
    assert(card != NULL);
    assert(blockCount != 0U);
    assert(timeout != 0U);

    uint32_t eraseBlockStart;
    uint32_t eraseBlockEnd;
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;

    /* polling card status idle */
    error = SD_PollingCardStatusBusy(card, SD_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        SDMMC_LOG("Error : write failed, card status busy\r\n");
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    eraseBlockStart = startBlock;
    eraseBlockEnd   = eraseBlockStart + blockCount - 1U;
    if (0U == (card->flags & (uint32_t)kSD_SupportHighCapacityFlag))
    {
        eraseBlockStart = eraseBlockStart * FSL_SDMMC_DEFAULT_BLOCK_SIZE;
        eraseBlockEnd   = eraseBlockEnd * FSL_SDMMC_DEFAULT_BLOCK_SIZE;
    }

    /* Send ERASE_WRITE_BLOCK_START command to set the start block number to erase. */
    command.index              = (uint32_t)kSD_EraseWriteBlockStart;
    command.argument           = eraseBlockStart;
    command.responseType       = kCARD_ResponseTypeR1;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = NULL;
    error           = SD_Transfer(card, &content, 1U);
    if (kStatus_Success != error)
    {
        SDMMC_LOG("\r\nError: send CMD32(erase start) failed with host error %d, response %x\r\n", error,
                  command.response[0U]);
        return kStatus_SDMMC_TransferFailed;
    }

    /* Send ERASE_WRITE_BLOCK_END command to set the end block number to erase. */
    command.index    = (uint32_t)kSD_EraseWriteBlockEnd;
    command.argument = eraseBlockEnd;

    content.command = &command;
    content.data    = NULL;
    error           = SD_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        SDMMC_LOG("\r\nError: send CMD33(erase end) failed with host error %d, response %x\r\n", error,
                  command.response[0U]);
        return kStatus_SDMMC_TransferFailed;
    }

    /* Send ERASE command to start erase process. */
    command.index              = (uint32_t)kSDMMC_Erase;
    command.argument           = 0U;
    command.responseType       = kCARD_ResponseTypeR1b;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = NULL;
    error           = SD_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        SDMMC_LOG("\r\nError: send CMD38(erase) failed with host error %d, response %x\r\n", error,
                  command.response[0U]);
        return kStatus_SDMMC_TransferFailed;
    }

