solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
    /* polling card status idle */
    error = SD_PollingCardStatusBusy(card, timeout);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        SDMMC_LOG("Error : write failed, card status busy\r\n");
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    return kStatus_Success;
}

bool SD_CheckReadOnly(sd_card_t *card)
{
    assert(card != NULL);

    return (((card->csd.flags & (uint16_t)kSD_CsdPermanentWriteProtectFlag) != 0U) ||
            ((card->csd.flags & (uint16_t)kSD_CsdTemporaryWriteProtectFlag)) != 0U);
}

status_t SD_ReadBlocks(sd_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);
    assert((blockCount + startBlock) <= card->blockCount);

    uint32_t blockLeft;
    uint32_t blockCountOneTime = 0U;
    uint32_t blockDone         = 0U;
    uint8_t *nextBuffer        = buffer;
    bool dataAddrAlign         = true;
    uint8_t *alignBuffer       = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error             = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    blockLeft = blockCount;

    while (blockLeft != 0U)
    {
        nextBuffer = (uint8_t *)((uint32_t)buffer + blockDone * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        if ((!card->noInteralAlign) && (!dataAddrAlign || ((((uint32_t)nextBuffer) & (sizeof(uint32_t) - 1U)) != 0U)))
        {
            blockCountOneTime = 1;
            (void)memset(alignBuffer, 0, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            dataAddrAlign = false;
            blockLeft -= blockCountOneTime;
        }
        else
        {
            if (blockLeft > card->host->maxBlockCount)
            {
                blockLeft         = (blockLeft - card->host->maxBlockCount);
                blockCountOneTime = card->host->maxBlockCount;
            }
            else
            {
                blockCountOneTime = blockLeft;
                blockLeft         = 0U;
            }
        }

        error = SD_Read(card, dataAddrAlign ? nextBuffer : alignBuffer, (startBlock + blockDone),
                        FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime);
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_TransferFailed;
            break;
        }

        blockDone += blockCountOneTime;

        if (!card->noInteralAlign && (!dataAddrAlign))
        {
            (void)memcpy(nextBuffer, alignBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SD_WriteBlocks(sd_card_t *card, const uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);
    assert((blockCount + startBlock) <= card->blockCount);

    uint32_t blockCountOneTime   = 0U; /* The block count can be wrote in one time sending WRITE_BLOCKS command. */
    uint32_t blockWrittenOneTime = 0U;
    uint32_t blockLeft           = 0U; /* Left block count to be wrote. */
    const uint8_t *nextBuffer;
    bool dataAddrAlign   = true;
    uint8_t *alignBuffer = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error       = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    blockLeft = blockCount;
    while (blockLeft != 0U)
    {
        nextBuffer = (uint8_t *)((uint32_t)buffer + (blockCount - blockLeft) * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        if (!card->noInteralAlign && (!dataAddrAlign || ((((uint32_t)nextBuffer) & (sizeof(uint32_t) - 1U)) != 0U)))
        {
            blockCountOneTime = 1;
            (void)memcpy(alignBuffer, nextBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            dataAddrAlign = false;
        }
        else
        {
            if (blockLeft > card->host->maxBlockCount)
            {
                blockCountOneTime = card->host->maxBlockCount;
            }
            else
            {
                blockCountOneTime = blockLeft;
            }
        }

        error = SD_Write(card, dataAddrAlign ? nextBuffer : alignBuffer, (startBlock + blockCount - blockLeft),
                         FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime, &blockWrittenOneTime);
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_TransferFailed;
            break;
        }

        blockLeft -= blockWrittenOneTime;

        if ((!card->noInteralAlign) && !dataAddrAlign)
        {
            (void)memset(alignBuffer, 0, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SD_EraseBlocks(sd_card_t *card, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(blockCount != 0U);
    assert((blockCount + startBlock) <= card->blockCount);

    status_t error                 = kStatus_Success;
    uint32_t blockCountOneTime     = 0U; /* The block count can be erased in one time sending ERASE_BLOCKS command. */
    uint32_t blockTail             = 0U; /* The block tail has been erased. */
    uint32_t blockLeft             = blockCount; /* Left block count to be erase. */
    uint32_t blockHead             = startBlock; /* Completed block Index */
    uint32_t auBlocks              = 0U;
    uint32_t auTimeout             = 250U; /* 250ms erase timeout by default */
    uint32_t onetimeMaxEraseBlocks = 0U;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    if ((card->stat.auSize == 0U) && (card->stat.eraseTimeout == 0U))
    {
        /* sdsc card erasable sector is determined by CSD register */
        if ((card->csd.flags & kSD_CsdEraseBlockEnabledFlag) != 0U)
        {
            error = SD_Erase(card, startBlock, blockCount, 250U * blockCount);
        }
        SDMMC_LOG("\r\n erase block directly: total %d, start %d, timeout %d, status %d \r\n", blockCount, startBlock,
                  250U * blockCount, error);
    }
    else
    {
        /* UHS card should use uhs au size field */
        if (card->operationVoltage == kSDMMC_OperationVoltage180V)
        {
            auBlocks = s_sdAuSizeMap[card->stat.uhsAuSize == 0U ? card->stat.auSize : card->stat.uhsAuSize] /
                       FSL_SDMMC_DEFAULT_BLOCK_SIZE;
        }
        else
        {
            auBlocks = s_sdAuSizeMap[card->stat.auSize] / FSL_SDMMC_DEFAULT_BLOCK_SIZE;
        }

        auTimeout = (((uint32_t)card->stat.eraseTimeout * 1000U) / (uint32_t)card->stat.eraseSize) +
                    card->stat.eraseOffset * 1000U;

        /* erase blocks within one AU */
        if ((startBlock + blockCount) < (startBlock / auBlocks + 1U) * auBlocks)
        {
            error = SD_Erase(card, startBlock, blockCount, auTimeout + 500U);

            SDMMC_LOG("\r\n erase blockS within AU : total %d, start %d, timeout %d, status %d \r\n", blockCount,
                      startBlock, auTimeout + 500U, error);
        }
        else
        {
            /* Erase partially start block */
            if ((startBlock % auBlocks) != 0U)
            {
                blockCountOneTime = (startBlock / auBlocks + 1U) * auBlocks - startBlock;
                error             = SD_Erase(card, startBlock, blockCountOneTime, auTimeout + 250U);

                SDMMC_LOG("\r\n erase partially block head : total %d, start %d, timeout %d, status %d \r\n",
                          blockCountOneTime, startBlock, auTimeout + 250U, error);
            }

            /* Erase au align blocks */
            if (kStatus_Success == error)
            {
                blockLeft -= blockCountOneTime;
                blockHead += blockCountOneTime;

                blockTail = blockLeft % auBlocks;
                blockLeft -= blockTail;

                onetimeMaxEraseBlocks = auBlocks;
                if (card->stat.eraseSize != 0U)
                {
                    onetimeMaxEraseBlocks *= card->stat.eraseSize;
                }

                while (blockLeft != 0U)
                {
                    if (blockLeft > onetimeMaxEraseBlocks)
                    {
                        blockCountOneTime = onetimeMaxEraseBlocks;
                        blockLeft         = blockLeft - blockCountOneTime;
                    }
                    else
                    {
                        blockCountOneTime = blockLeft;
                        blockLeft         = 0U;
                    }

                    error = SD_Erase(card, blockHead, blockCountOneTime, (blockCountOneTime / auBlocks) * auTimeout);
                    SDMMC_LOG("\r\n erase AU block head : total %d, start %d, timeout %d, status %d \r\n",
                              blockCountOneTime, blockHead, (blockCountOneTime / auBlocks) * auTimeout, error);
                    if (error != kStatus_Success)
                    {
                        break;
                    }

                    blockHead += blockCountOneTime;
                }
            }

