solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
            /* Erase partially end block */
            if ((error == kStatus_Success) && (blockTail))
            {
                error = SD_Erase(card, blockHead, blockTail, auTimeout + 250U);
                SDMMC_LOG("\r\n erase partially tail block : total %d, start %d, timeout %d, status %d \r\n", blockTail,
                          blockHead, auTimeout + 250U, error);
            }
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

static status_t SD_ProbeBusVoltage(sd_card_t *card)
{
    assert(card != NULL);

    uint32_t applicationCommand41Argument = 0U;
    status_t error                        = kStatus_Success;

    /* 3.3V voltage should be supported as default */
    applicationCommand41Argument |=
        SDMMC_MASK(kSD_OcrVdd29_30Flag) | SDMMC_MASK(kSD_OcrVdd32_33Flag) | SDMMC_MASK(kSD_OcrVdd33_34Flag);

    if ((card->usrParam.ioVoltage != NULL) && (card->usrParam.ioVoltage->type != kSD_IOVoltageCtrlNotSupport) &&
        ((card->host->capability & (uint32_t)kSDMMCHOST_SupportVoltage1v8) != 0U) &&
        ((card->host->capability & ((uint32_t)kSDMMCHOST_SupportSDR104 | (uint32_t)kSDMMCHOST_SupportSDR50 |
                                    (uint32_t)kSDMMCHOST_SupportDDRMode)) != 0U))
    {
        /* allow user select the work voltage, if not select, sdmmc will handle it automatically */
        applicationCommand41Argument |= SDMMC_MASK(kSD_OcrSwitch18RequestFlag);
        /* reset to 3v3 signal voltage */
        if (SD_SwitchIOVoltage(card, kSDMMC_OperationVoltage330V) == kStatus_Success)
        {
            /* Host changed the operation signal voltage successfully, then card need power reset */
            SD_SetCardPower(card, false);
            SD_SetCardPower(card, true);
        }
    }

    card->operationVoltage = kSDMMC_OperationVoltage330V;

    /* send card active */
    SDMMCHOST_SendCardActive(card->host);

    do
    {
        /* card go idle */
        if (kStatus_Success != SD_GoIdle(card))
        {
            error = kStatus_SDMMC_GoIdleFailed;
            break;
        }

        error = SD_SendInterfaceCondition(card);
        /* Check card's supported interface condition. */
        if (kStatus_Success == error)
        {
            /* SDHC or SDXC card */
            applicationCommand41Argument |= SDMMC_MASK(kSD_OcrHostCapacitySupportFlag);
            card->flags |= (uint32_t)kSD_SupportSdhcFlag;
        }
        else
        {
            /* SDSC card */
            if (kStatus_Success != SD_GoIdle(card))
            {
                error = kStatus_SDMMC_GoIdleFailed;
                break;
            }
        }
        error = SD_ApplicationSendOperationCondition(card, applicationCommand41Argument);
        /* Set card interface condition according to SDHC capability and card's supported interface condition. */
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_HandShakeOperationConditionFailed;
            break;
        }

        /* check if card support 1.8V */
        if ((card->flags & (uint32_t)kSD_SupportVoltage180v) != 0U)
        {
            if ((card->usrParam.ioVoltage != NULL) && (card->usrParam.ioVoltage->type == kSD_IOVoltageCtrlNotSupport))
            {
                break;
            }

            error = SD_SwitchVoltage(card, kSDMMC_OperationVoltage180V);
            if (kStatus_SDMMC_SwitchVoltageFail == error)
            {
                break;
            }

            if (error == kStatus_SDMMC_SwitchVoltage18VFail33VSuccess)
            {
                applicationCommand41Argument &= ~SDMMC_MASK(kSD_OcrSwitch18RequestFlag);
                card->flags &= ~(uint32_t)kSD_SupportVoltage180v;
                continue;
            }
            else
            {
                card->operationVoltage = kSDMMC_OperationVoltage180V;
                break;
            }
        }
        break;
    } while (true);

    return error;
}

static status_t sdcard_init(sd_card_t *card)
{
    assert(card != NULL);
    assert(card->isHostReady == true);
    status_t error = kStatus_Success;

    /* reset variables */
    card->flags = 0U;
    /* set DATA bus width */
    SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith1Bit);
    /*set card freq to 400KHZ*/
    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, SDMMC_CLOCK_400KHZ);

    error = SD_ProbeBusVoltage(card);
    /* probe bus voltage*/
    if (error != kStatus_Success)
    {
        return kStatus_SDMMC_SwitchVoltageFail;
    }

    error = SD_AllSendCid(card);
    /* Initialize card if the card is SD card. */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_AllSendCidFailed;
    }

    error = SD_SendRca(card);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SendRelativeAddressFailed;
    }

    error = SD_SendCsd(card);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SendCsdFailed;
    }

    error = SD_SelectCard(card, true);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SelectCardFailed;
    }

    /* Set to max frequency in non-high speed mode. */
    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, SD_CLOCK_25MHZ);

    error = SD_SendScr(card);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SendScrFailed;
    }

    /* Set to 4-bit data bus mode. */
    if ((card->flags & (uint32_t)kSD_Support4BitWidthFlag) != 0U)
    {
        error = SD_SetDataBusWidth(card, kSDMMC_BusWdith4Bit);
        if (kStatus_Success != error)
        {
            return kStatus_SDMMC_SetDataBusWidthFailed;
        }
        SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith4Bit);
    }

    /* try to get card current status */
    error = SD_ReadStatus(card);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SendScrFailed;
    }

