solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sd/fsl_sd.c
    error = SD_SetBlockSize(card, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    /* set block size */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SetCardBlockSizeFailed;
    }

    error = SD_SelectBusTiming(card);
    /* select bus timing */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    return kStatus_Success;
}

status_t SD_CardInit(sd_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_Success;
    /* create mutex lock */
    (void)SDMMC_OSAMutexCreate(&card->lock);
    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    SD_SetCardPower(card, true);

    error = sdcard_init(card);

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

void SD_CardDeinit(sd_card_t *card)
{
    assert(card != NULL);

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    (void)SD_SelectCard(card, false);
    SD_HostDoReset(card);
    SD_SetCardPower(card, false);
    (void)SDMMC_OSAMutexDestroy(&card->lock);
}

status_t SD_HostInit(sd_card_t *card)
{
    assert(card != NULL);
    assert(card->usrParam.cd != NULL);

    status_t error = kStatus_Success;

    if (!card->isHostReady)
    {
        error = SDMMCHOST_Init(card->host);
        if (error != kStatus_Success)
        {
            return kStatus_Fail;
        }
    }

    if ((card->usrParam.cd->type == kSD_DetectCardByHostCD) || (card->usrParam.cd->type == kSD_DetectCardByHostDATA3))
    {
        (void)SDMMCHOST_CardDetectInit(card->host, card->usrParam.cd);
    }

    /* set the host status flag, after the card re-plug in, don't need init host again */
    card->isHostReady = true;

    return kStatus_Success;
}

void SD_HostDeinit(sd_card_t *card)
{
    assert(card != NULL);

    SDMMCHOST_Deinit(card->host);
    /* should re-init host */
    card->isHostReady = false;
}

void SD_SetCardPower(sd_card_t *card, bool enable)
{
    assert(card != NULL);

    uint32_t powerDelay = 0U;

    if (card->usrParam.pwr != NULL)
    {
        card->usrParam.pwr(enable);
    }
    else
    {
        SDMMCHOST_SetCardPower(card->host, enable);
    }

    if (enable)
    {
        powerDelay = card->usrParam.powerOnDelayMS == 0U ? SD_POWER_ON_DELAY : card->usrParam.powerOnDelayMS;
    }
    else
    {
        powerDelay = card->usrParam.powerOffDelayMS == 0U ? SD_POWER_OFF_DELAY : card->usrParam.powerOffDelayMS;
    }

    SDMMC_OSADelay(powerDelay);
}

bool SD_IsCardPresent(sd_card_t *card)
{
    assert(card != NULL);
    assert(card->usrParam.cd != NULL);

    if (card->usrParam.cd->type == kSD_DetectCardByGpioCD)
    {
        if (card->usrParam.cd->cardDetected == NULL)
        {
            return false;
        }
        return card->usrParam.cd->cardDetected();
    }
    else
    {
        if (card->isHostReady == false)
        {
            return false;
        }

        if (SDMMCHOST_CardDetectStatus(card->host) == (uint32_t)kSD_Removed)
        {
            return false;
        }
    }

    return true;
}

status_t SD_PollingCardInsert(sd_card_t *card, uint32_t status)
{
    assert(card != NULL);
    assert(card->usrParam.cd != NULL);

    if (card->usrParam.cd->type == kSD_DetectCardByGpioCD)
    {
        if (card->usrParam.cd->cardDetected == NULL)
        {
            return kStatus_Fail;
        }

        do
        {
            if ((card->usrParam.cd->cardDetected() == true) && (status == (uint32_t)kSD_Inserted))
            {
                SDMMC_OSADelay(card->usrParam.cd->cdDebounce_ms);
                if (card->usrParam.cd->cardDetected() == true)
                {
                    break;
                }
            }

            if ((card->usrParam.cd->cardDetected() == false) && (status == (uint32_t)kSD_Removed))
            {
                break;
            }
        } while (true);
    }
    else
    {
        if (card->isHostReady == false)
        {
            return kStatus_Fail;
        }

        if (SDMMCHOST_PollingCardDetectStatus(card->host, status, ~0U) != kStatus_Success)
        {
            return kStatus_Fail;
        }
    }

    return kStatus_Success;
}

status_t SD_Init(sd_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_Success;

    if (!card->isHostReady)
    {
        error = SD_HostInit(card);
        if (error != kStatus_Success)
        {
            error = kStatus_SDMMC_HostNotReady;
        }
    }
    else
    {
        SD_HostDoReset(card);
    }

    if (kStatus_Success == error)
    {
        if (SD_PollingCardInsert(card, kSD_Inserted) != kStatus_Success)
        {
            error = kStatus_SDMMC_CardDetectFailed;
        }
        else
        {
            error = SD_CardInit(card);
            if (error != kStatus_Success)
            {
                error = kStatus_SDMMC_CardInitFailed;
            }
        }
    }

    return error;
}

void SD_Deinit(sd_card_t *card)
{
    /* card deinitialize */
    SD_CardDeinit(card);
    /* host deinitialize */
    SD_HostDeinit(card);
}

void SD_HostDoReset(sd_card_t *card)
{
    SDMMCHOST_Reset(card->host);
}
